[{"content":"***Before.***\n\n*Miles “Pudge” Halter is done with his safe life at home. His whole life has been one big non-event, and his obsession with famous last words has only made him crave “the Great Perhaps” even more (Francois Rabelais, poet). He heads off to the sometimes crazy and anything-but-boring world of Culver Creek Boarding School, and his life becomes the opposite of safe. Because down the hall is Alaska Young. The gorgeous, clever, funny, sexy, self-destructive, screwed up, and utterly fascinating Alaska Young. She is an event unto herself. She pulls Pudge into her world, launches him into the Great Perhaps, and steals his heart. Then. . . .*\n\n***After.***\n\n*Nothing is ever the same.*\n\n- - -\n\nI came across this book when one of my goodreads friends posted a review of it. I was looking for a short read and was intrigued by the premise. I'm glad I picked it up because it turned out to be a great read!\n\nI really enjoyed this book for many reasons. The book follows an interesting pattern where it's split into two sections: **before** and **after**. Right from the start that tells us that some event happens around half way through the book. In the first half, each chapter is X number of days 'before', and the countdown definitely added an air of mystery to it. It's something I've never seen before and quite enjoyed that it was leading up to something.\n\nAnother thing I enjoyed was the style of writing. From the start, the writing is very clear and easy going which meant I couldn't put the book down. We see things from the viewpoint of Miles \"Pudge\" Halter, a teenager with not many friends who is about to head off to boarding school. That image can sometimes lead us to think we know what's going to happen, or what his boarding school experience might be like, but what I appreciated about this book was that it didn't do that. It didn't follow the standard story you would expect.\n\nThe friends he makes at the school are all very interesting characters, and some of the moments in the book were really funny. There was definitely a lot of fun moments throughout the book, and a lot of the 'before' section was lighthearted, but with a slightly darker undertone. Especially as it led up to the second half. We're seeing very young people questioning their place in the world and trying to find where they fit in.\n\nTo me, this book was charming, funny, heartwarming, and incredibly sad all at once. It's the kind of book that makes you feel, and there are many levels to it depending on how you choose to think about it. As I said before, I couldn't put the book down and I highly recommend it!\n\n- - -\n\nI've decided to try out using the [CAWPILE](http://thefloatinglibrary.blogspot.com/2019/08/what-is-cawpile-rating.html) rating system to rate the books I read and review. I'm also a huge fan of quotes, so for each review from now on I plan to post a favourite quote or two from that book.\n\n**CAWPILE rating:**\n\n⭐️⭐️⭐️⭐️ (4 stars)\n\n### Quote from the book\n\n> “You spend your whole life stuck in the labyrinth, thinking about how you’ll escape it one day, and how awesome it will be, and imagining that future keeps you going, but you never do it. You just use the future to escape the present.”","isEmpty":false,"excerpt":"","title":"Looking for Alaska by John Green","subtitle":"Looking for Alaska by John Green","category":["Book Reviews"],"author":"Lynne Finnigan","date":"2020-06-13T15:05:23.301Z","featureImage":"/uploads/img_3559.jpg","slug":"looking-for-alaska-by-john-green"},{"content":"*Four hundred and eighty seconds. That’s how long it took for someone to steal Marin Machado's four-year-old son.*\n\n*Marin had the perfect life. Married to her college sweetheart, she owns a chain of upscale hair salons, and Derek runs his own company. They're admired in their community and are a loving family. Up until the day Sebastian is taken.*\n\nThis novel starts with any parents' worst nightmare. In a busy market, Marin Machado let's go of her 4 year old son's hand for just a second and he was taken. The story unfolds from there, and the author does a good job of describing the shock, panic, anger, grief, and a million other emotions that you must be feeling in that moment and the following weeks and months.\n\nAfter the kidnapping, we see that it has affected Marin and Derek's relationship in a big way. Unfortunately, the story then focuses on that for a large part of the book and although ultimately it's still about what happened to her son, that seems to take a backseat for a while.\n\nI struggled with this review a little, because I had heard very good things about this book and had high expectations going in. The author was very good at getting across the characters emotions, and the story itself was interesting enough that I couldn't really put the book down. I wanted to find out what happened next. So although I didn’t feel a huge connection with the characters, I did want to follow the story and see where it went.\n\nThere were some twists and turns but I felt like I knew what was coming most of the time, and connected the dots pretty quickly. The conclusion that I suspected early on is what happened after all, and I don’t feel like there was an attempt to lead you down any other road in terms of suspects, which I found disappointing.\n\nI read this book very quickly (in just one day), so it clearly held my attention, and if you like books of this genre, or a quick holiday read then I'm sure it will be enjoyable. Personally, I liked it but I was just too disappointed with the ending and had hoped for a bit more of a shock factor or a few more surprises along the way.","isEmpty":false,"excerpt":"","title":"Little Secrets by Jennifer Hillier","subtitle":"Little Secrets by Jennifer Hillier","category":["Book Reviews"],"author":"Lynne Finnigan","date":"2020-05-31T13:37:50.255Z","featureImage":"/uploads/img_3560.jpg","slug":"little-secrets-by-jennifer-hillier"},{"content":"I wasn't sure what to expect with this book after reading some mixed reviews. I am a big fan of The Farseer trilogy, and the Tawny Man trilogy by Robin Hobb, and although I enjoyed The Liveship Traders trilogy, it took me a long time to get into it. Quite a bit of time actually, the end of book two was where I really started to enjoy it.\n\nThe reason I mention The Liveship Traders trilogy is because The Dragon Keeper is set in Bingtown and the Rain Wilds, two locations we first discover in The Liveship Traders. It also features some characters we know and love from the previous books.\n\nI really enjoyed reading this book, despite the mixed reviews I read beforehand. The problem I had with The Liveship Traders was that it felt like it took so long to get to the exciting part of the story. There was a lot of build up. But I loved the characters, and the general setting and story. This book solves that problem in the sense that I already knew about Bingtown and the politics there, as well as the Rain Wilds and its history. That meant that I could just jump into The Dragon Keeper without needing too much explanation.\n\nThere are some subtle references in this book to events that happened in The Tawny Man trilogy also, which I thought was a nice touch. In the previous books we had followed the sea serpents, making the difficult journey to the Rain Wilds to cocoon and become dragons. This book picks up straight from there, at a time when the serpents are about to hatch into dragons. We follow a character called Thymara. She is young and naive, and has lived a fairly sheltered life but when the opportunity comes up for her to become a dragon keeper and help to move the dragons to a new location, she decides that it is something she must do. I like Thymara as a character, and it is interesting to see her develop as the story goes on.\n\nWe also follow the rather sad life of Alise Kincarron, a scholar from Bingtown studying dragons and elderlings. This book follows her life in Bingtown, and then follows with a journey to the Rain Wilds to study the dragons. Alise is one of the more interesting characters, and it is great to watch her discover more about herself as the story unfolds.\n\nFor the most part, I couldn't put this book down. It kept me wanting to know what happened next and I read it in no time. It's not my favourite of the Robin Hobb books, but if you really enjoyed Liveship Traders then I think this book will be for you. I'm looking forward to starting the next one soon!","isEmpty":false,"excerpt":"","title":"The Dragon Keeper (Rain Wilds Chronicles #1) by Robin Hobb","subtitle":"The Dragon Keeper (Rain Wilds Chronicles #1) by Robin Hobb","category":["Book Reviews"],"author":"Lynne Finnigan","date":"2020-04-26T12:30:35.478Z","featureImage":"/uploads/dragonkeeper.jpg","slug":"the-dragon-keeper-rain-wilds-chronicles-1-by-robin-hobb"},{"content":"*In the world of The Binding, books are a taboo subject. People visit book binders to have their unwanted memories bound into a book and hidden away forever. Once their memories are bound into a book, they have no recollection of them anymore. The story follows Emmett Farmer, a boy who can no longer work on the farm he grew up on due to a recent illness, and is sent to live with a binder as her apprentice. One day he meets a customer of hers and senses an odd connection with him. Little does he know, that chance meeting would change his whole life.*\n\nI first picked up this book in Waterstones in Glasgow. I had heard of the title, but had no idea what the book was about, or even what genre really. While wandering through the shop, it caught my eye. The beautiful front cover, with the purple edged pages. It drew me in, and after a quick read of the summary I thought, why not? I'll pick it up and see what it's like.\n\nIt took a while for me to get the premise and understand why people thought of books as a taboo subject. It's set in a world that is reminiscent of 19th-century England, and the only kind of fantasy element to the story is the concept of binding one's memories into a book. I enjoyed the setting and it wasn't too descriptive, which I liked. It left plenty of room for the imagination.\n\nThis book is very much about the characters, and I love good character development. Emmett Farmer is the main character, and although I liked him for the most part, there were definitely parts of him I didn't like. This is what I really enjoyed about the book, the characters had dimension. There were times when he would do something or say something stupid and I would feel frustrated about it. I felt like I was on a journey with him, and discovering things about his past alongside him.\n\nThe book kept me intrigued and wanting to know more. Around half way through the book, I reached the stage where I couldn't put it down. I had to know what happened next. There were twists and turns which kept me engaged throughout.\n\nThe writing was good and it took an interesting turn in the last third of the book where it switched to a different character's perspective entirely. Having seen things from Emmett Farmer's perspective up until that point, it was an interesting change. Personally I found this perspective slightly less enjoyable, however I feel like it was required and it showed that Bridget Collins had really fleshed out the characters. It was such a contrast, which showed how well the characters were written in this book.\n\nI would consider the book to be a romance, even if it's not necessarily written in that way. Having no prior knowledge other than reading the cover, I was pleasantly surprised by this. It had a kind of underlying tension in the beginning and took a while for things to unfold (which some people don't enjoy or have the patience for), but I like that it took some time to get there and some aspects of the story hit very close to home.\n\nOverall I really enjoyed the book and can safely say I've never read anything quite like it before. It was unique, whimsical, dark, well-written, and kept my attention throughout.","isEmpty":false,"excerpt":"","title":"The Binding by Bridget Collins","subtitle":"The Binding by Bridget Collins","category":["Book Reviews"],"author":"Lynne Finnigan","date":"2020-04-04T12:23:03.525Z","featureImage":"/uploads/img_3561-2.jpg","slug":"the-binding-by-bridget-collins"}]