[{"content":"I wasn't sure what to expect with this book after reading some mixed reviews. I am a big fan of The Farseer trilogy, and the Tawny Man trilogy by Robin Hobb, and although I enjoyed The Liveship Traders trilogy, it took me a long time to get into it. Quite a bit of time actually, the end of book two was where I really started to enjoy it.\n\nThe reason I mention The Liveship Traders trilogy is because The Dragon Keeper is set in Bingtown and the Rain Wilds, two locations we first discover in The Liveship Traders. It also features some characters we know and love from the previous books.\n\nI really enjoyed reading this book, despite the mixed reviews I read beforehand. The problem I had with The Liveship Traders was that it felt like it took so long to get to the exciting part of the story. There was a lot of build up. But I loved the characters, and the general setting and story. This book solves that problem in the sense that I already knew about Bingtown and the politics there, as well as the Rain Wilds and its history. That meant that I could just jump into The Dragon Keeper without needing too much explanation.\n\nThere are some subtle references in this book to events that happened in The Tawny Man trilogy also, which I thought was a nice touch. In the previous books we had followed the sea serpents, making the difficult journey to the Rain Wilds to cocoon and become dragons. This book picks up straight from there, at a time when the serpents are about to hatch into dragons. We follow a character called Thymara. She is young and naive, and has lived a fairly sheltered life but when the opportunity comes up for her to become a dragon keeper and help to move the dragons to a new location, she decides that it is something she must do. I like Thymara as a character, and it is interesting to see her develop as the story goes on.\n\nWe also follow the rather sad life of Alise Kincarron, a scholar from Bingtown studying dragons and elderlings. This book follows her life in Bingtown, and then follows with a journey to the Rain Wilds to study the dragons. Alise is one of the more interesting characters, and it is great to watch her discover more about herself as the story unfolds.\n\nFor the most part, I couldn't put this book down. It kept me wanting to know what happened next and I read it in no time. It's not my favourite of the Robin Hobb books, but if you really enjoyed Liveship Traders then I think this book will be for you. I'm looking forward to starting the next one soon!","isEmpty":false,"excerpt":"","title":"The Dragon Keeper (Rain Wilds Chronicles #1) by Robin Hobb","subtitle":"The Dragon Keeper (Rain Wilds Chronicles #1) by Robin Hobb","category":["Book Reviews"],"author":"Lynne Finnigan","date":"2020-04-26T12:30:35.478Z","featureImage":"/uploads/dragonkeeper.jpg","slug":"the-dragon-keeper-rain-wilds-chronicles-1-by-robin-hobb"},{"content":"*In the world of The Binding, books are a taboo subject. People visit book binders to have their unwanted memories bound into a book and hidden away forever. Once their memories are bound into a book, they have no recollection of them anymore. The story follows Emmett Farmer, a boy who can no longer work on the farm he grew up on due to a recent illness, and is sent to live with a binder as her apprentice. One day he meets a customer of hers and senses an odd connection with him. Little does he know, that chance meeting would change his whole life.*\n\nI first picked up this book in Waterstones in Glasgow. I had heard of the title, but had no idea what the book was about, or even what genre really. While wandering through the shop, it caught my eye. The beautiful front cover, with the purple edged pages. It drew me in, and after a quick read of the summary I thought, why not? I'll pick it up and see what it's like.\n\nIt took a while for me to get the premise and understand why people thought of books as a taboo subject. It's set in a world that is reminiscent of 19th-century England, and the only kind of fantasy element to the story is the concept of binding one's memories into a book. I enjoyed the setting and it wasn't too descriptive, which I liked. It left plenty of room for the imagination.\n\nThis book is very much about the characters, and I love good character development. Emmett Farmer is the main character, and although I liked him for the most part, there were definitely parts of him I didn't like. This is what I really enjoyed about the book, the characters had dimension. There were times when he would do something or say something stupid and I would feel frustrated about it. I felt like I was on a journey with him, and discovering things about his past alongside him.\n\nThe book kept me intrigued and wanting to know more. Around half way through the book, I reached the stage where I couldn't put it down. I had to know what happened next. There were twists and turns which kept me engaged throughout.\n\nThe writing was good and it took an interesting turn in the last third of the book where it switched to a different character's perspective entirely. Having seen things from Emmett Farmer's perspective up until that point, it was an interesting change. Personally I found this perspective slightly less enjoyable, however I feel like it was required and it showed that Bridget Collins had really fleshed out the characters. It was such a contrast, which showed how well the characters were written in this book.\n\nI would consider the book to be a romance, even if it's not necessarily written in that way. Having no prior knowledge other than reading the cover, I was pleasantly surprised by this. It had a kind of underlying tension in the beginning and took a while for things to unfold (which some people don't enjoy or have the patience for), but I like that it took some time to get there and some aspects of the story hit very close to home.\n\nOverall I really enjoyed the book and can safely say I've never read anything quite like it before. It was unique, whimsical, dark, well-written, and kept my attention throughout.","isEmpty":false,"excerpt":"","title":"The Binding by Bridget Collins","subtitle":"The Binding by Bridget Collins","category":["Book Reviews"],"author":"Lynne Finnigan","date":"2020-04-04T12:23:03.525Z","featureImage":"/uploads/fc2e4a03-21b2-4026-ab60-e9909a262473.jpeg","slug":"the-binding-by-bridget-collins"}]